#) დაწერეთ პროგრამა რომელიც თუ მოქალაქე არის 18 წლის და მას აქვს მართვის მოწმობა შეუშვებს ქვეყანაში       2) მომხმარებელმა ფასდაკლება უნდა მიიღოს თუ 100 ლარზე მეტ რამეს ყიდულობს ან არის vip მომხმარებელი    3) ოთახის გათბობა აქტიურდება თუ ტემპერატურა ან ძალიან დაბალია ან ძალიან მაღალი        4) სკოლაში მხოლოდ ისეთი სტუდენტები შედიან რომლებიც სტუდენტური ბარათბით შედიან ან მასწავლებლის ნებართვა აქვთ   დაწერე ინფუთებით


# მომხმარებლის მონაცემები
age = int(input("შეიყვანეთ თქვენი ასაკი: "))
has_license = input("გაქვთ მართვის მოწმობა? (yes/no): ").lower()

# ლოგიკა
if age >= 18 and has_license == "yes":
    print("შეგიძლიათ შემოსვლა ქვეყანაში.")
else:
    print("არ შეგიძლიათ შესვლა ქვეყანაში.")


# მომხმარებლის ინფორმაცია
purchase_amount = float(input("რამდენი ფული დახარჯეთ? ლარში: "))
is_vip = input("მთვლელი VIP მომხმარებელია? (yes/no): ").lower()

# ფასდაკლება
if purchase_amount > 100 or is_vip == "yes":
    print("გგზავნით ფასდაკლებას!")
else:
    print("ფასდაკლება არ გეძლევათ.")


# ტემპერატურა
temperature = float(input("რა ტემპერატურაა ოთახში? (Celsius): "))

# ტემპერატურის შემოწმება
if temperature < 18 or temperature > 28:
    print("გათბობა აქტიურდება.")
else:
    print("გათბობა არ საჭიროებს აქტივაციას.")


# სტუდენტის მონაცემები
has_student_card = input("გაქვთ სტუდენტური ბარათი? (yes/no): ").lower()
has_teacher_permission = input("გაქვთ მასწავლებლის ნებართვა? (yes/no): ").lower()

# ლოგიკა
if has_student_card == "yes" or has_teacher_permission == "yes":
    print("შეუძლიათ სკოლაში შესვლა.")
else:
    print("არ გაქვთ შესვლის უფლება.")

