#2) დაწერე პროგრამა, რომელიც ამოწმებს, შეყვანილი რიცხვი 5-სა და 15-ს შორის არის, მაგრამ არა 10-ის ტოლი.   3) მომხმარებელმა უნდა შეიყვანოს თავისი ასაკი და სახელი. პროგრამამ უნდა შეამოწმოს, რომ ასაკი 18-ზე მეტია და სახელი იწყება "A"-ზე.  4) დაწერე პროგრამა, რომელიც ამოწმებს, რიცხვი ლუწია ან 3-ის გამყოფი.   5) პროგრამამ უნდა გამოიანგარიშოს, მოცემული ორი რიცხვიდან რომელიმე 100-ის ტოლი ან მასზე მეტია თუ არა.


# შეყვანილი რიცხვი
number = int(input("შეიყვანეთ რიცხვი: "))

# ლოგიკა
if 5 < number < 15 and number != 10:
    print("რიცხვი არის 5-სა და 15-ს შორის, მაგრამ არ არის 10.")
else:
    print("რიცხვი არ აკმაყოფილებს პირობებს.")
  

  # მომხმარებლის მონაცემები
name = input("შეიყვანეთ თქვენი სახელი: ")
age = int(input("შეიყვანეთ თქვენი ასაკი: "))

# ლოგიკა
if age > 18 and name[0].lower() == "a":
    print("თქვენ დააკმაყოფილეთ პირობები!")
else:
    print("თქვენ არ აკმაყოფილებთ მოთხოვნებს.")


# შეყვანილი რიცხვი
number = int(input("შეიყვანეთ რიცხვი: "))

# ლოგიკა
if number % 2 == 0 or number % 3 == 0:
    print("რიცხვი არის ლუწი ან 3-ის გამყოფი.")
else:
    print("რიცხვი არც ლუწია და არც 3-ის გამყოფი.")


# შეყვანილი ორი რიცხვი
num1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = int(input("შეიყვანეთ მეორე რიცხვი: "))

# ლოგიკა
if num1 >= 100 or num2 >= 100:
    print("ერთ-ერთი რიცხვი არის 100-ის ტოლი ან მასზე მეტი.")
else:
    print("რიცხვები არც ერთი არ არის 100-ის ტოლი ან მასზე მეტი.")
